app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "New Post"], ["description", "I was just born!"], ["created_at", "2020-01-11 07:45:14.217231"], ["updated_at", "2020-01-11 07:45:14.217231"], ["author_id", 7]]
---
  def create

    @post = Post.new(post_params)
    @post.save